Week_4/Day_1/adress_book/app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts"  ORDER BY name ASC
SELECT "contacts".* FROM "contacts"
---
  def index
<<<<<<< HEAD
    @contacts = Contact.all.order("name ASC")
=======
    @contacts = Contact.all

INSERT INTO "contacts" ("name", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Manuel Figueroa Andrade"], ["phone", 609], ["email", "m.figand@gmail.com"], ["created_at", "2016-02-22 19:52:36.628147"], ["updated_at", "2016-02-22 19:52:36.628147"]]
---
  def create

    contact = Contact.new(
    :name => params[:contact][:name],
    :adress => params[:contact][:adress],
    :phone => params[:contact][:phone],
    :email => params[:contact][:email])

    contact.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 12]]
---
  def show
    @contact = Contact.find params[:id]