Week_6/Day_2/auction/app/controllers/reviews_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", nil]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", "1"]]
---
  def index
    # binding.pry
    @product = Product.find(params[:product_id])
    @review = @product.reviews.all

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("description", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "asfd"], ["product_id", "1"], ["created_at", "2016-03-08 18:08:08.980997"], ["updated_at", "2016-03-08 18:08:08.980997"]]
---
  def create
    @product = Product.find(params[:product_id])
    @review = @product.reviews.new(review_params)

    if @review.save