Week_4/Day_2/timetracking/app/controllers/entries_controller.rb

  def index
    @projects = Project.find(params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 2]]