Week_4/Day_2/shortener/app/controllers/link_controller.rb

  def shortlink
    @originallink = params[:link][:originallink]
    link = Link.create(originallink: @originallink, shortlink: "345")
---
INSERT INTO "links" ("originallink", "shortlink", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def show
    link = Link.where(shortlink: params[:shortlink])
---
SELECT  "links".* FROM "links" WHERE "links"."shortlink" = ?  ORDER BY "links"."id" ASC LIMIT 1  [["shortlink", "345"]]