Week_6/Day_1/taskly/app/controllers/api/v1/tasks_controller.rb

  def index
    completed_tasks = @user.tasks.where(completed: true)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."completed" = ?  [["user_id", 1], ["completed", "t"]]

    task = @user.tasks.create(task_params)
---
INSERT INTO "tasks" ("name", "due_date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Tarea 1"], ["due_date", "2016-03-07 10:38:10.000000"], ["user_id", 1], ["created_at", "2016-03-07 10:46:28.753439"], ["updated_at", "2016-03-07 10:46:28.753439"]]