Week_6/Day_1/taskly/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "pepe"], ["email", "pe@pe.com"], ["created_at", "2016-03-07 09:36:21.474147"], ["updated_at", "2016-03-07 09:36:21.474147"]]
---
  def create
    user = User.create(user_params)