Week_6/Day_2/taskly_ironhack/app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "completed", "user_id", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Tarea 1"], ["completed", "t"], ["user_id", 2], ["due_date", "2016-03-08 10:09:00.000000"], ["created_at", "2016-03-08 10:09:21.770072"], ["updated_at", "2016-03-08 10:09:21.770072"]]