Week_6/Day_1/video-games/app/controllers/players_controller.rb

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 12]]
---
  def create
    tournament = Tournament.find(params[:id])