Week_6/Day_1/video-games/app/controllers/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def show_list_tournaments
    tournaments = Tournament.all

INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "arena"], ["created_at", "2016-03-07 17:26:33.421729"], ["updated_at", "2016-03-07 17:26:33.421729"]]
---
  def create
    tournament = Tournament.create(tournament_params)

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 0]]
DELETE FROM "tournaments" WHERE "tournaments"."id" = ?  [["id", 2]]
---
  def delete
    tournament = Tournament.find(params[:id])
    tournament.destroy